app/controllers/controls_controller.rb

SELECT * FROM `presets` WHERE (`presets`.`id` = 1)
SELECT * FROM `links` WHERE (`links`.`panel` = 'central')
---
	def central
		# assign instance variables
		@client_id = "central"
		@presets = Preset.find(:all)
		@links = Link.find(:all, :conditions => { :panel => "central" })

SELECT * FROM `presets` WHERE (`presets`.`id` = 1)
SELECT * FROM `links` WHERE (`links`.`panel` = 'bedroom')
---
	def bedroom
		# assign instance variables
		@client_id = "bedroom"
		@presets = Preset.find(:all)
		@status = populate_status
		@links = Link.find(:all, :conditions => { :panel => "bedroom" })

SELECT * FROM `links` WHERE (`links`.`panel` = 'garage')
---
	def garage
		# assign instance variables
		@client_id = "garage"
		@presets = Preset.find(:all)
		@status = populate_status
		@links = Link.find(:all, :conditions => { :panel => "garage" })