app/controllers/presets_controller.rb

SELECT * FROM `presets`
---
  def index
  	logger.debug "presets/index called"
    @presets = Preset.all

SELECT * FROM `presets` WHERE (`presets`.`id` = 1)
---
  def show
    @preset = Preset.find(params[:id])

SELECT * FROM `presets` WHERE (`presets`.`id` = 1)
---
  def edit
    @preset = Preset.find(params[:id])

INSERT INTO `presets` (`name`, `light_ext_switch_balcony`, `updated_at`, `hvac_int_thermostat_main`, `light_int_dim_living`, `light_int_switch_stair`, `light_ext_switch_west_entry`, `light_ext_switch_west_flood`, `light_int_switch_garage`, `light_int_switch_loft`, `ambient_canvas_pwm_a`, `light_int_dim_dining`, `ambient_canvas_pwm_b`, `created_at`, `light_ext_switch_garage_sign`) VALUES(NULL, 0, '2010-02-05 05:38:12', 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, '2010-02-05 05:38:12', 0)
---
  def create
    @preset = Preset.new(params[:preset])

    respond_to do |format|
      if @preset.save

SELECT * FROM `presets` WHERE (`presets`.`id` = 1)
UPDATE `presets` SET `updated_at` = '2010-02-05 05:38:05', `name` = 'Home' WHERE `id` = 1
---
  def update
    @preset = Preset.find(params[:id])

    respond_to do |format|
      if @preset.update_attributes(params[:preset])