app/controllers/residents_controller.rb

INSERT INTO `residents` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('0ecb95a065748058ba80ff5929d68bc494aa2a69', '2010-02-04 19:52:48', '21c908dc42032b47aaa373bf449f0ebd845ff05e', NULL, NULL, 'johnny.rodgers', 'johnny.rodgers@gmail.com', '2010-02-04 19:52:48')
---
  def create
    cookies.delete :auth_token
    @resident = Resident.new(params[:resident])
    @resident.save